repository/resources/perf-test/results/wso2_results_round1.txt
Warm-up ...
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.293164 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,134.60 [#/sec] (mean)
Time per request:		12.293 [ms] (mean)
Time per request:		0.123 [ms] (mean, across all concurrent requests)
Transfer rate:			15,878.74 [Kbytes/sec] received
				15,878.74 kb/s sent
				31,757.49 kb/s total
Warmup Completed!
Warm-up ...
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.043741 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,054.90 [#/sec] (mean)
Time per request:		11.044 [ms] (mean)
Time per request:		0.110 [ms] (mean, across all concurrent requests)
Transfer rate:			17,675.17 [Kbytes/sec] received
				17,675.17 kb/s sent
				35,350.34 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.993735 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,096.09 [#/sec] (mean)
Time per request:		10.994 [ms] (mean)
Time per request:		0.110 [ms] (mean, across all concurrent requests)
Transfer rate:			17,755.57 [Kbytes/sec] received
				17,755.57 kb/s sent
				35,511.14 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.007171 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,084.99 [#/sec] (mean)
Time per request:		11.007 [ms] (mean)
Time per request:		0.110 [ms] (mean, across all concurrent requests)
Transfer rate:			17,733.89 [Kbytes/sec] received
				17,733.89 kb/s sent
				35,467.79 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.470384 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,718.10 [#/sec] (mean)
Time per request:		11.470 [ms] (mean)
Time per request:		0.115 [ms] (mean, across all concurrent requests)
Transfer rate:			17,017.74 [Kbytes/sec] received
				17,017.74 kb/s sent
				34,035.48 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.061378 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,290.93 [#/sec] (mean)
Time per request:		12.061 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,183.89 [Kbytes/sec] received
				16,183.89 kb/s sent
				32,367.78 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.987013 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,342.36 [#/sec] (mean)
Time per request:		11.987 [ms] (mean)
Time per request:		0.120 [ms] (mean, across all concurrent requests)
Transfer rate:			16,284.29 [Kbytes/sec] received
				16,284.29 kb/s sent
				32,568.58 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.853821 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,436.10 [#/sec] (mean)
Time per request:		11.854 [ms] (mean)
Time per request:		0.119 [ms] (mean, across all concurrent requests)
Transfer rate:			16,467.26 [Kbytes/sec] received
				16,467.26 kb/s sent
				32,934.53 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.112771 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,255.75 [#/sec] (mean)
Time per request:		12.113 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,115.22 [Kbytes/sec] received
				16,115.22 kb/s sent
				32,230.45 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.666220 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,895.02 [#/sec] (mean)
Time per request:		12.666 [ms] (mean)
Time per request:		0.127 [ms] (mean, across all concurrent requests)
Transfer rate:			15,411.07 [Kbytes/sec] received
				15,411.07 kb/s sent
				30,822.14 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.422178 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,050.12 [#/sec] (mean)
Time per request:		12.422 [ms] (mean)
Time per request:		0.124 [ms] (mean, across all concurrent requests)
Transfer rate:			15,713.83 [Kbytes/sec] received
				15,713.83 kb/s sent
				31,427.66 kb/s total
Warmup Completed!
===== CBR Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.817561 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,801.80 [#/sec] (mean)
Time per request:		12.818 [ms] (mean)
Time per request:		0.128 [ms] (mean, across all concurrent requests)
Transfer rate:			15,229.11 [Kbytes/sec] received
				15,229.11 kb/s sent
				30,458.21 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.894832 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,755.05 [#/sec] (mean)
Time per request:		12.895 [ms] (mean)
Time per request:		0.129 [ms] (mean, across all concurrent requests)
Transfer rate:			15,137.85 [Kbytes/sec] received
				15,137.85 kb/s sent
				30,275.70 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.958019 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,717.23 [#/sec] (mean)
Time per request:		12.958 [ms] (mean)
Time per request:		0.130 [ms] (mean, across all concurrent requests)
Transfer rate:			15,064.03 [Kbytes/sec] received
				15,064.03 kb/s sent
				30,128.06 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.065273 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,653.88 [#/sec] (mean)
Time per request:		13.065 [ms] (mean)
Time per request:		0.131 [ms] (mean, across all concurrent requests)
Transfer rate:			14,940.37 [Kbytes/sec] received
				14,940.37 kb/s sent
				29,880.74 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.209592 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,570.26 [#/sec] (mean)
Time per request:		13.210 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,777.14 [Kbytes/sec] received
				14,777.14 kb/s sent
				29,554.28 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.196165 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,577.96 [#/sec] (mean)
Time per request:		13.196 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,792.18 [Kbytes/sec] received
				14,792.18 kb/s sent
				29,584.35 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.482902 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,416.80 [#/sec] (mean)
Time per request:		13.483 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,477.60 [Kbytes/sec] received
				14,477.60 kb/s sent
				28,955.19 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.839196 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,225.85 [#/sec] (mean)
Time per request:		13.839 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,104.87 [Kbytes/sec] received
				14,104.87 kb/s sent
				28,209.73 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.304378 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,516.32 [#/sec] (mean)
Time per request:		13.304 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,671.86 [Kbytes/sec] received
				14,671.86 kb/s sent
				29,343.72 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.300322 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,518.62 [#/sec] (mean)
Time per request:		13.300 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,676.34 [Kbytes/sec] received
				14,676.34 kb/s sent
				29,352.67 kb/s total
=== Completed ===
===== CBR Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.424773 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,738.96 [#/sec] (mean)
Time per request:		17.425 [ms] (mean)
Time per request:		0.174 [ms] (mean, across all concurrent requests)
Transfer rate:			11,202.44 [Kbytes/sec] received
				11,202.44 kb/s sent
				22,404.88 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.197738 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,814.72 [#/sec] (mean)
Time per request:		17.198 [ms] (mean)
Time per request:		0.172 [ms] (mean, across all concurrent requests)
Transfer rate:			11,350.33 [Kbytes/sec] received
				11,350.33 kb/s sent
				22,700.66 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.477405 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,721.67 [#/sec] (mean)
Time per request:		17.477 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,168.71 [Kbytes/sec] received
				11,168.71 kb/s sent
				22,337.41 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.585164 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,686.61 [#/sec] (mean)
Time per request:		17.585 [ms] (mean)
Time per request:		0.176 [ms] (mean, across all concurrent requests)
Transfer rate:			11,100.27 [Kbytes/sec] received
				11,100.27 kb/s sent
				22,200.53 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.532411 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,703.72 [#/sec] (mean)
Time per request:		17.532 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,133.67 [Kbytes/sec] received
				11,133.67 kb/s sent
				22,267.33 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.724040 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,642.05 [#/sec] (mean)
Time per request:		17.724 [ms] (mean)
Time per request:		0.177 [ms] (mean, across all concurrent requests)
Transfer rate:			11,013.29 [Kbytes/sec] received
				11,013.29 kb/s sent
				22,026.58 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.989474 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,558.81 [#/sec] (mean)
Time per request:		17.989 [ms] (mean)
Time per request:		0.180 [ms] (mean, across all concurrent requests)
Transfer rate:			10,850.79 [Kbytes/sec] received
				10,850.79 kb/s sent
				21,701.58 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.285903 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,785.06 [#/sec] (mean)
Time per request:		17.286 [ms] (mean)
Time per request:		0.173 [ms] (mean, across all concurrent requests)
Transfer rate:			11,292.44 [Kbytes/sec] received
				11,292.44 kb/s sent
				22,584.88 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.544920 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,699.66 [#/sec] (mean)
Time per request:		17.545 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,125.73 [Kbytes/sec] received
				11,125.73 kb/s sent
				22,251.45 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.543492 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,700.12 [#/sec] (mean)
Time per request:		17.543 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,126.63 [Kbytes/sec] received
				11,126.63 kb/s sent
				22,253.27 kb/s total
=== Completed ===
===== Transform Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.503220 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,404.46 [#/sec] (mean)
Time per request:		18.503 [ms] (mean)
Time per request:		0.185 [ms] (mean, across all concurrent requests)
Transfer rate:			6,804.22 [Kbytes/sec] received
				10,549.52 kb/s sent
				17,353.74 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.758377 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,330.95 [#/sec] (mean)
Time per request:		18.758 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			6,711.67 [Kbytes/sec] received
				10,406.02 kb/s sent
				17,117.69 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.877876 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,297.21 [#/sec] (mean)
Time per request:		18.878 [ms] (mean)
Time per request:		0.189 [ms] (mean, across all concurrent requests)
Transfer rate:			6,669.18 [Kbytes/sec] received
				10,340.15 kb/s sent
				17,009.33 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.794710 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,320.65 [#/sec] (mean)
Time per request:		18.795 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			6,698.69 [Kbytes/sec] received
				10,385.90 kb/s sent
				17,084.59 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.684634 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,351.99 [#/sec] (mean)
Time per request:		18.685 [ms] (mean)
Time per request:		0.187 [ms] (mean, across all concurrent requests)
Transfer rate:			6,738.16 [Kbytes/sec] received
				10,447.09 kb/s sent
				17,185.24 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.222934 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,202.12 [#/sec] (mean)
Time per request:		19.223 [ms] (mean)
Time per request:		0.192 [ms] (mean, across all concurrent requests)
Transfer rate:			6,549.47 [Kbytes/sec] received
				10,154.54 kb/s sent
				16,704.01 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.893374 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,292.86 [#/sec] (mean)
Time per request:		18.893 [ms] (mean)
Time per request:		0.189 [ms] (mean, across all concurrent requests)
Transfer rate:			6,663.71 [Kbytes/sec] received
				10,331.66 kb/s sent
				16,995.38 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.817983 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,314.07 [#/sec] (mean)
Time per request:		18.818 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			6,690.41 [Kbytes/sec] received
				10,373.06 kb/s sent
				17,063.47 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.445352 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,421.42 [#/sec] (mean)
Time per request:		18.445 [ms] (mean)
Time per request:		0.184 [ms] (mean, across all concurrent requests)
Transfer rate:			6,825.57 [Kbytes/sec] received
				10,582.61 kb/s sent
				17,408.18 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.018314 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,258.09 [#/sec] (mean)
Time per request:		19.018 [ms] (mean)
Time per request:		0.190 [ms] (mean, across all concurrent requests)
Transfer rate:			6,619.93 [Kbytes/sec] received
				10,263.79 kb/s sent
				16,883.73 kb/s total
=== Completed ===